# CLI Tools
brew "bat"          # Better cat with syntax highlighting
brew "cloc"         # Count lines of code
brew "delta"        # Syntax-highlighting git diff pager
brew "eza"          # Modern ls replacement
brew "fd"           # Fast find alternative
brew "ffmpeg"       # Audio/video processing
brew "gh"           # GitHub CLI
brew "git"          # Git
brew "gitversion"   # Semantic versioning from git history
brew "go"           # Go language (also managed by mise)
brew "mise"         # Runtime version manager (replaces nvm, pyenv, rbenv)
brew "python@3.13"  # Python 3.13
brew "ripgrep"      # Fast grep alternative (rg)
brew "uv"           # Fast Python package manager
brew "yarn"         # Node package manager

# Casks
cask "1password", args: { adopt: true }          # Password manager
cask "1password-cli", args: { adopt: true }      # 1Password CLI (op)
cask "ghostty", args: { adopt: true }            # Terminal emulator
